{"pageProps":{"blognum":29,"key1":9,"slugprev":"complete_a_project","frontmatter":{"title":"Single-source Publishing","date":"2022-02-10","lastmod":"2022-02-10","draft":"false","tags":["Singlesource","Publishing"],"categories":["Samples"],"author":"Susan"},"slug":"video_samples","content":"Nowadays, there are many different kinds of media formats such as a PDF file for reading on a computer, an HTML searchable file for reading online, and an InDesign file for paper printout publishing. In a traditional document management system, source files usually are authored in different formats for different publishing media. When a product is updated, the documentation that describes the product needs to be modified or even rewritten. A content maintenance team needs to apply changes on the same content to various versions of source files.\n \nObviously, many duplicate works are conducted for the same content, just because there are more source files for the same content based on each output media format. The main reason for this situation is that the content and presentation are together. So in a traditional content management system, the process of documents updating takes more human power, longer production period of time, and more chance of having errors due to human-involved formatting. Under the circumstance that requires translation because of internationalization, the expensive cost of translation will also be tremendously wasted due to the multi-version of source files for the same content.\n \nWhile technology is developing rapidly, products are upgraded more and more frequently; therefore, the documents updating period is getting shorter and shorter. That requires a faster, more accurate, and more cost-effective solution in the content managing and publishing process.\n\nA single-source publishing system solves the problems existing in a traditional content management system. A single-source publishing system mainly does two things: firstly, it separates the content from the presentation and keeps any content only in one source file. Secondly, it stores the source file in a structured way; it divides the content into small units called topics. And for each topic, a set of metadata is designed to describe it.\n\nA single-source publishing software application is required for switching to single-source publishing, and the application mainly consists of two parts: content authoring part and content publishing part.\n\nThe content authoring part is used for authoring and editing content that will be saved in an XML file in most single-source publishing applications. The XML format is a very popular and convenient format to store and transfer information, and it makes it possible to separate the content from its presentation.\n \nThe publishing part mainly consists of more than one converting or transformation module that can read the content from the XML file and convert the content into different kinds of output formats according to the publishing media.\n \nThe benefits of using a single-source publishing system are as follows:\n1. Keep only one source file for the same content, so only one version needs to be updated whenever an update is required. This will save lots of human power and time because no duplicate work needs to be done.\n2. When internationalization is required, only one source file of the same content needs to be translated. So that the expensive translation cost will be reduced.\n3. Computer software is used to convert content to required formats. That means no human interference is involved in the formatting process, so errors caused by human formatting are eliminated.\n4. The logical workflow, reasonable way to organize content, and auto-formatting significantly shorten the production cycle.  \nTo conclude, using a single-source publishing solution can deliver technical content of much better quality, fast speed, and at a much lower cost; that will increase customers’ satisfaction and enhance the competitiveness of an organization.\n\nIf your organization is struggling to deliver quality content at a reasonable cost and timely manner, you might need to consider switching to a single-source publishing solution."},"__N_SSG":true}