{"pageProps":{"blognum":24,"key1":20,"slugprev":"ws_usersmanual_explanation","frontmatter":{"title":"Build a Static Site with Hugo on GitHub","date":"2022-01-26","lastmod":"2022-01-26","draft":"false","tags":["Howto","Hugo"],"categories":[""],"author":"Susan"},"slug":"WhyStaticWebsiteGenerator","content":"I set up my first Hugo-generated website on GitHub through the following steps. I wrote this file to help whose familiar with GitHub and command line and want to build their static website using Hugo by following simple command lines without detailed explanations.\n\nI'm using a Mac mini m1.\n\n**Instll Hugo**\n\nIf you have Homebrew installed on your Mac, just run:\n```shell\nbrew install hugo\n```\nThe Hugo will be installed on the Mac.\n\n**Create a new Hugo site**\n\nI used two repos for my website; one is called portfolio used to store my original files, and another is the susanpeng.github.io repo used to store the deployed code, static files.\n\nUnder selected folder (say Desktop folder), clone the portfolio repo to the local computer:\n```shell\ngit clone https://github.com/susanpeng/portfolio.git\n```\nGet into the local repo's folder:\n```shell\ncd portfolio\n```\nCreate a new Hugo site:\n```shell\nhugo new site portfoliosite\n```\nThis command creates a site with the name portfoliosite. It also creates a folder portfoliosite under the folder portfolio.\n\nGet into the portfoliosite:\n```shell\ncd portfoliosite\n```\nYou can see folders, such as archetypes, content, layouts, themes, data, and static, as well as a config.toml file.\n\n**Pick and download a theme you like**\n\nPut the theme under the themes folder:\n```shell\ncd themes\n```\nGo to Hugo site to pick a theme.\nYou can copy or clone the picked theme into the themes folder.\n\n**Change your site's config file**\n\nIn the example folder under the picked-theme folder (portfoliosite/themes/picked-theme/exampleSite), you can see a config.toml file; copy its content to your site's confit.toml file under your site folder (portfoliosite).\nThen modify your config.toml file to set:\n\nbaseURL = \"https://susanpeng.github.io/\"\n\ntitle = \"The name of your site\"\n\ntheme=\"The name of your picked theme\"\n\n**Preview of the Hugo site**\n```shell\nhugo server\n```\nThis command will start a development server locally on port 1313.\n\nOpen your browser, and put \"http://localhost:1313/ in the address bar. You will see your Hugo site.\nTo stop the Hugo server, press Ctl+c and press return.\n\n**Write your content**\n\nCreate a new .md file in the post folder:\n```shell\nhugo new post/my-first-post.md\n```\nAdd some content in the .md file. You should see your Hugo site changed, and the content of my-first-post.md appears on the site.\n\n**Add Submodule to another repo**\n\nWe want to store the static assets (deployed code) in another repo called susanpeng.github.io. \n\n**Note:** You must create the repo susanpeng.github.io and push to main at least once before continuing.\n\n\nRun the following command to add the submodule:\n```shell\ngit submodule add -b main https://github.com/susanpeng/susanpeng.github.io.git public\n```\n\"public\" is the folder under portfoliosite folder; it stores all static files generated by Hugo. After adding \"public\" as the submodule of the repo susanpeng.github.io, you can push the files (or changes) under public to susapeng.github.io. And then you can see your site at https://susanpeng.github.io/.\n\nWhen you get into the public folder, you can see that the folder is connected to the repo susanpeng.github.io:\n```shell\ncd public\ngit remote -v\norigin\thttps://github.com/susanpeng/susanpeng.github.io.git (fetch)\norigin\thttps://github.com/susanpeng/susanpeng.github.io.git (push)\n```\nYou can see that the origin points to the repo susanpeng.github.io, because you are in the submodule of the repo susanpeng.github.io.\n\nTo generate static files:\n```shell\ncd .. # back to portfoliosite folder\nhugo -t theme-name\n``` \nAll static files will automatically go to the local public folder.\n\nTo put the static files to GitHub:\n```shell\ncd public\ngit add .\ngit commit -m \"put your static assets on the GitGub: repo username.github.io\"\ngit push origin main\n```\nNow, you can see your new site from https://susanpeng.gitgub.io.\n\nIf you are following this how-to to build your first Hugo site on GutHub, use your GitHub username to replace susanpeng in this article.\n\n\n\n"},"__N_SSG":true}