{"pageProps":{"blognum":22,"key1":11,"slugprev":"ws_web_service_install","frontmatter":{"title":"The 29 Steps of a Documentation Project","date":"2022-01-28","lastmod":"2022-01-28","draft":"false","tags":["DocumentProject","Procedure"],"categories":[""],"author":"Susan"},"slug":"participate_in_a_doc_effort","content":"Here is a traditionally recommended general sequence of the 29 steps for a documentation project:\n\n1. Discuss the need for the document with your client.\n2. Determine the purpose and objectives of the document.\n3. Talk to intended users of the documents.\n4. Profile the users’ information needs.\n5. Prepare an outline of the planned contents of the documents\n6. Design the layout of the document.\n7. Plan the online version of the document.\n8. Prepare style guidelines or a style sheet.\n9. Prepare a sample section of the document (a prototype).\n10. Estimate time and costs to write and produce the document.\n11. Schedule the project.\n12. Review document plan with client and get approval.\n13. Gather all relevant background information.\n14. Conduct detailed interviews with subject matter experts.\n15. Draft sections of the document.\n16. Prepare graphics.\n17. Format (layout) draft sections of the document.\n18. Edit draft sections.\n19. Review draft sections with subject experts and revise.\n20. Review draft sections with the project team and revise.\n21. Test accuracy and completeness of critical sections of the document.\n22. Prepare alphabetical index.\n23. Final edit and proofread.\n24. Review the completed document with the project team and get approval to print.\n25. Prepare the online version of the document.\n26. Design and print covers.\n27. Prepare printing specifications and coordinate printing.\n28. Distribute the printed document.\n29. Get feedback from the final users of the document on its effectiveness.\n\nLots of situations might call for changing this sequence a bit. Some software documentation is written for developers or even contributed by developers, such as docs for API or SDK. Following the philosophy of Docs-as-code, the document will be written in Markdown and published on a website; it may not need a print-out version like PDF. As a result, the procedure will change accordingly.\n\n"},"__N_SSG":true}