{"pageProps":{"blognum":22,"key1":12,"slugprev":"29_steps_doc_prj","frontmatter":{"title":"Describe Your Participation in a Documentation Effort","date":"2022-01-28","lastmod":"2022-01-28","draft":"false","tags":["Interview","DocProject"],"categories":[""],"author":"Susan"},"slug":"experience_with_git","content":"**The App:** The development team developed a mobile App for worldwide practitioners to practice meditation. The practitioners can:\n* register for upcoming meditation courses;\n* record their everyday meditation practice;\n* write journals to reflect on their practicing results;\n* watch online videos from previous classes;\n* download massive meditation instructional videos and music;\n* offer lights for their loved ones;\n\nand more.\n\n**What I Did:** I participated in the documentation project of this mobile App.\nWe had a group of three writers working on this documentation project.\n\nWe had a meeting with the App's development team to get the primary understanding of this App and used every section of it.\nThen we discussed and decided on the deliverables. We all agreed to create the documentation as a website including text content for simple functions and videos for more complex functions. \n\nWe decided that the documentation would be in English, Chinese, and Korean. Later, we could add Russian and Indonesian versions after finding suitable translators.\n\nThen we created file name conventions and a style sheet to keep the document's consistency, as we needed some new rules that were not in our organization's style guide.\n\nWe listed all sections we would need to write and roughly divided them into three parts; each writer would be responsible for one part. We also made a plan with a schedule for the work progress. We also discussed and decided on the sections that needed a video to enhance their effectiveness; we borrowed a member from the video production team to work on the videos.\n\nWe discussed and planned the layout; then, we created a prototype with some draft sections and planned layout, putting it on the internal website and sending the link to the product team for approval.\n\nOnce we got approved with some feedback, we started writing content. Everone's writing was edited by another writer.\n\nI used VS Code to write the Markdown, command+shift+4 to get screenshots, and Mac’s preview to add annotations. I have Adobe Photoshop and TechSmith Snagit, but I didn’t use them because they are too slow.\n\nThe completed writings are done and sent to the subject experts for review. We will revise after we get back the feedback. The project is close to finishing now because we don't plan to produce a print-out version of the document.\n\nDue to the development team may add new functions for this App, we will need to write documents for the new functions. Adding new sections to the website should be easy since the main structure has already been established."},"__N_SSG":true}