{"pageProps":{"blognum":29,"key1":24,"slugprev":"ws_restfulapi_explanation","frontmatter":{"title":"Writing Samples: User's Manual and Usability Testing Report","date":"2022-01-27","lastmod":"2022-01-27","draft":"false","tags":["WritingSample","UsersManual"],"categories":["Samples"],"author":"Susan"},"slug":"hugo-how-to","content":"\nBookshelf Editor User's Manual (https://susanpeng.github.io/docs/helpmanual/index.html)\n\nUsability Testing Report (https://susanpeng.github.io/docs/helpmanualusa/index.html)\n\nI created this User's Mnual as my technical writing course project. I received the Bookshelf Editor program without any documentation. I had to go through the whole program to figure out all functions and operational steps by clicking menu items, buttons and links on the screen. After obtaining a sufficient understanding of the program, I created this User's Manual. It was a great process of learning technical concepts and skills and then converting them into clear and concise content for a general audience.\n\nTo enhance the effectiveness of this User's Manual, I conducted a usability test to get feedback from the test participants. Then I modified the User's Manual according to the test feedback and created the Usability Testing Report.\n\nI created this manual using Oxygen XML Editor. The links here point to the plain HTML version of the manual and the report. I can also easily get the PDF, ePub and WebHelp output according to the audience's need by using Oxygen XML Editor's transformation function.\n\nThe usability test report shows that I value the document's usability and effectiveness and the process to improve them.\n\nThe Index and Glossary also make the user's manual easy to use, especially when searching for information.\n\nThe usability test report shows that I understand the importance of making documentation usable and effective.\n\nI have learned a lot about the entire process of creating a software user's manual from working on this writing project.\n\nRecently, I edited the manual and report using VS Code and uploaded it to the repo of GitHub.\n\nI was the writer and editor of the user's manual. I received the instructor and classmates ' suggestions while creating the user's manual and test report.\n"},"__N_SSG":true}