{"pageProps":{"blognum":7,"key1":0,"slugprev":"api-reference-links","frontmatter":{"title":"Writing Samples v20211225","date":"2022-01-23","lastmod":"2022-01-23","draft":"false","tags":["UsersManual","OnlineHelp","WritingSample"],"categories":["Samples"],"author":"Susan"},"slug":"api-reference-links","content":"This document includes two projects:\n\n1. Aegisub Quick Start (https://aegisubquickstart.wordpress.com/)\n\n   As an excellent subtitle-adding software, Aegisub has been used intensively in my company's video production team. However, its official tutorial is highly text-intensive with little graphics, so I wrote this Quick Start manual to help beginners start quickly and save time and effort during training.  This Quick Start manual has significantly reduced the time and human power when training new team members and also dramatically reduced the learning curve for learners.\n\n2. Bookshelf Editor User's Manual\n\n   Bookshelf Editor User's Manual \n   (https://susanpeng.github.io/docs/helpmanual/index.html)\n   \n   Usability Testing Report (https://susanpeng.github.io/docs/helpmanualusa/index.html)\n\n   I created this User's Manual as a project in one of my Technical Writing courses. I received the Bookshelf Editor program without any documentation. I had to go through the whole program to figure out all functions and operational steps by clicking menu items, buttons and links on screen in the program. After obtaining a sufficient understanding of the program, I created this User's Manual; it was a great process of learning technical concepts and skills to convert them into clear and concise content for a general audience.\n\n   To enhance the effectiveness of this User's Manual, I conducted a usability test to get feedback from the test participants. Then I further modified the User's Manual according to the test feedback. The Usability Testing Report is included in this sample.\n\n   This manual was created using Oxygen XML Editor and provided in plain HTML output. Its DITA content can be easily transformed into PDF, ePub and WebHelp output to meet different needs."},"__N_SSG":true}